bpel.samples/resources/AsynchronousSample/AsynchronousSample/src/AsynchronousSampleClient.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<wsdl:definitions name="AsynchronousSampleClient"
                  targetNamespace="http://enterprise.netbeans.org/bpel/AsynchronousSampleClient"
                  xmlns:tns="http://enterprise.netbeans.org/bpel/AsynchronousSampleClient"
                  xmlns:xs="http://enterprise.netbeans.org/bpel/AsynchronousSampleSchemaNamespace"
                  xmlns:partnerNS="http://enterprise.netbeans.org/bpel/AsynchronousSample" 
                  xmlns="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"                          
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype"
                  xmlns:bpws="http://docs.oasis-open.org/wsbpel/2.0/varprop">

    <import namespace="http://enterprise.netbeans.org/bpel/AsynchronousSample" location="AsynchronousSample.wsdl"/>
        
    <types>
        <xsd:schema xmlns="http://enterprise.netbeans.org/bpel/AsynchronousSampleSchemaNamespace" 
                    targetNamespace="http://enterprise.netbeans.org/bpel/AsynchronousSample">
            <xsd:import namespace="http://enterprise.netbeans.org/bpel/AsynchronousSampleSchemaNamespace" schemaLocation="AsynchronousSample.xsd"/>
        </xsd:schema>
    </types>

    <wsdl:message name="requestMessageClient">
        <wsdl:part name="inputType" element="xs:typeA"/>
    </wsdl:message>
    <wsdl:message name="responseMessageClient">
        <wsdl:part name="resultType" element="xs:typeA"/>
    </wsdl:message>
               
    <wsdl:portType name="MyPortTypeClient">
        <wsdl:operation name="operationA">
            <wsdl:input  message="tns:requestMessageClient" />
            <wsdl:output message="tns:responseMessageClient"/>
        </wsdl:operation>              
    </wsdl:portType>

    <binding name="SoapBindingClient" type="tns:MyPortTypeClient">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="operationA">
            <soap:operation/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>         
    </binding>
        
    <wsdl:service name="AsynchronousClientService">
        <wsdl:port name="AsynchronousClientPortName" binding="tns:SoapBindingClient">                    
            <soap:address location="http://localhost:18181/AsynchronousSampleClient"/>
        </wsdl:port>
    </wsdl:service>
   
    <plnk:partnerLinkType name="AsynchronousClientPartnerLinkType">
        <plnk:role name="AsynchronousClientProvider"
                   portType="tns:MyPortTypeClient">
        </plnk:role>
    </plnk:partnerLinkType>
    
    <bpws:property name="correlatorProp" type="xsd:string" />    

    <bpws:propertyAlias 
        propertyName="tns:correlatorProp"
        messageType="tns:requestMessageClient"
        part="inputType">
        <bpws:query>/typeA/id</bpws:query>
    </bpws:propertyAlias>

    <bpws:propertyAlias 
        propertyName="tns:correlatorProp"
        messageType="partnerNS:responseMessage"
        part="resultType">
        <bpws:query>/typeA/id</bpws:query>        
    </bpws:propertyAlias>
</wsdl:definitions>
