bpel.samples/resources/AsynchronousSample/AsynchronousSampleApplication/test/NewTestcase0/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:typeA xmlns:asy="http://enterprise.netbeans.org/bpel/AsynchronousSampleSchemaNamespace" xmlns:msgns="http://enterprise.netbeans.org/bpel/AsynchronousSampleClient" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns1="http://enterprise.netbeans.org/bpel/AsynchronousSampleSchemaNamespace">
      <paramA>Hello Asynchronous World</paramA>
      <id>18</id>
    </ns1:typeA>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
